Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.107/BZ25/atdf/PIC32CX1012BZ25048.atdf
          </instance>
        </module>
        <module name="CMCC" id="U2015" version="6.0.0">
          <instance name="CMCC">
            <register-group name="CMCC" name-in-module="CMCC" address-space="base" offset="0x41002000"/>
            <parameters>
              <param name="INSTANCE_ID" value="33"/>
            </parameters>
          </instance>
        </module>
        <module name="CRU" id="03100" version="1.0">
          <instance name="CRU">
            <register-group name="CRU" name-in-module="CRU" address-space="base" offset="0x44000a00"/>
          </instance>
        </module>
        <module name="RCON" id="03100" version="1.0">
          <instance name="RCON">
            <register-group name="RCON" name-in-module="RCON" address-space="base" offset="0x44000a00"/>
          </instance>
        </module>
        <module name="DMAC" id="U2503" version="1.0.0">
          <instance name="DMAC">
            <register-group name="DMAC" name-in-module="DMAC" address-space="base" offset="0x41004000"/>
            <parameters>
              <param name="BURST" value="1"/>
              <param name="CH_BITS" value="5"/>
              <param name="CH_NUM" value="16"/>
              <param name="EVIN_NUM" value="8"/>
              <param name="EVOUT_NUM" value="4"/>
              <param name="FIFO_SIZE" value="16"/>
              <param name="LVL_BITS" value="2"/>
              <param name="LVL_NUM" value="4"/>
              <param name="QOSCTRL_D_RESETVALUE" value="2"/>
              <param name="QOSCTRL_F_RESETVALUE" value="2"/>
              <param name="QOSCTRL_WRB_RESETVALUE" value="2"/>
              <param name="TRIG_BITS" value="7"/>
              <param name="TRIG_NUM" value="85"/>
              <param name="INSTANCE_ID" value="34"/>
              <param name="CHANNEL0_INT_SRC" value="6" caption="DMA Channel 0 Interrupt"/>
              <param name="CHANNEL1_INT_SRC" value="6" caption="DMA Channel 1 Interrupt"/>
              <param name="CHANNEL2_INT_SRC" value="6" caption="DMA Channel 2 Interrupt"/>
              <param name="CHANNEL3_INT_SRC" value="6" caption="DMA Channel 3 Interrupt"/>
              <param name="CHANNEL4_INT_SRC" value="7" caption="DMA Channel 4 Interrupt"/>
              <param name="CHANNEL5_INT_SRC" value="7" caption="DMA Channel 5 Interrupt"/>
              <param name="CHANNEL6_INT_SRC" value="7" caption="DMA Channel 6 Interrupt"/>
              <param name="CHANNEL7_INT_SRC" value="7" caption="DMA Channel 7 Interrupt"/>
              <param name="CHANNEL8_INT_SRC" value="7" caption="DMA Channel 8 Interrupt"/>
              <param name="CHANNEL9_INT_SRC" value="7" caption="DMA Channel 9 Interrupt"/>
              <param name="CHANNEL10_INT_SRC" value="7" caption="DMA Channel 10 Interrupt"/>
              <param name="CHANNEL11_INT_SRC" value="7" caption="DMA Channel 11 Interrupt"/>
              <param name="CHANNEL12_INT_SRC" value="7" caption="DMA Channel 12 Interrupt"/>
              <param name="CHANNEL13_INT_SRC" value="7" caption="DMA Channel 13 Interrupt"/>
              <param name="CHANNEL14_INT_SRC" value="7" caption="DMA Channel 14 Interrupt"/>
              <param name="CHANNEL15_INT_SRC" value="7" caption="DMA Channel 15 Interrupt"/>
            </parameters>
          </instance>
        </module>
        <module name="DMT" id="01520" version="1.0">
          <instance name="DMT">
            <register-group name="DMT" name-in-module="DMT" address-space="base" offset="0x44000E00"/>
          </instance>
        </module>
        <module name="DSCON" id="01348" version="1.0">
          <instance name="DSCON">
            <register-group name="DSCON" name-in-module="DSCON" address-space="base" offset="0x42011000"/>
            <parameters>
              <param name="INSTANCE_ID" value="79"/>
            </parameters>
          </instance>
        </module>
        <module name="DSU" id="U2410" version="1.0.0">
          <instance name="DSU">
            <register-group name="DSU" name-in-module="DSU" address-space="base" offset="0x41000000"/>
            <parameters>
              <param name="DMAC_ID_DCC0" value="2"/>
              <param name="DMAC_ID_DCC1" value="3"/>
              <param name="INSTANCE_ID" value="32"/>
            </parameters>
          </instance>
        </module>
        <module name="EIC" id="U2254" version="3.0.0">
          <instance name="EIC">
            <register-group name="EIC" name-in-module="EIC" address-space="base" offset="0x40000800"/>
            <signals>
              <signal group="EXTINT" index="0" function="1" pad="PA03" ioset="1"/>
              <signal group="EXTINT" index="0" function="2" pad="PA07" ioset="1"/>
              <signal group="EXTINT" index="0" function="3" pad="PA11" ioset="1"/>
              <signal group="EXTINT" index="0" function="4" pad="PB00" ioset="1"/>
              <signal group="EXTINT" index="0" function="5" pad="PB04" ioset="1"/>
              <signal group="EXTINT" index="0" function="6" pad="PB08" ioset="1"/>
              <signal group="EXTINT" index="0" function="7" pad="PB12" ioset="1"/>
              <signal group="EXTINT" index="0" function="8" pad="PA02" ioset="1"/>
              <signal group="EXTINT" index="0" function="9" pad="PA06" ioset="1"/>
              <signal group="EXTINT" index="0" function="10" pad="PA10" ioset="1"/>
              <signal group="EXTINT" index="0" function="11" pad="PA14" ioset="1"/>
              <signal group="EXTINT" index="0" function="12" pad="PB03" ioset="1"/>
              <signal group="EXTINT" index="0" function="13" pad="PB07" ioset="1"/>
              <signal group="EXTINT" index="0" function="14" pad="PB11" ioset="1"/>
              <signal group="EXTINT" index="0" function="15" pad="PA09" ioset="1"/>
              <signal group="EXTINT" index="1" function="1" pad="PA04" ioset="2"/>
              <signal group="EXTINT" index="1" function="2" pad="PA08" ioset="2"/>
              <signal group="EXTINT" index="1" function="3" pad="PA12" ioset="2"/>
              <signal group="EXTINT" index="1" function="4" pad="PB01" ioset="2"/>
              <signal group="EXTINT" index="1" function="5" pad="PB05" ioset="2"/>
              <signal group="EXTINT" index="1" function="6" pad="PB09" ioset="2"/>
              <signal group="EXTINT" index="1" function="7" pad="PB13" ioset="2"/>
              <signal group="EXTINT" index="1" function="8" pad="PA03" ioset="2"/>
              <signal group="EXTINT" index="1" function="9" pad="PA07" ioset="2"/>
              <signal group="EXTINT" index="1" function="10" pad="PA11" ioset="2"/>
              <signal group="EXTINT" index="1" function="11" pad="PB00" ioset="2"/>
              <signal group="EXTINT" index="1" function="12" pad="PB04" ioset="2"/>
              <signal group="EXTINT" index="1" function="13" pad="PB08" ioset="2"/>
              <signal group="EXTINT" index="1" function="14" pad="PB12" ioset="2"/>
              <signal group="EXTINT" index="1" function="15" pad="PA00" ioset="2"/>
              <signal group="EXTINT" index="2" function="1" pad="PA05" ioset="3"/>
              <signal group="EXTINT" index="2" function="2" pad="PA09" ioset="3"/>
              <signal group="EXTINT" index="2" function="3" pad="PA13" ioset="3"/>
              <signal group="EXTINT" index="2" function="4" pad="PB02" ioset="3"/>
              <signal group="EXTINT" index="2" function="5" pad="PB06" ioset="3"/>
              <signal group="EXTINT" index="2" function="6" pad="PB10" ioset="3"/>
              <signal group="EXTINT" index="2" function="7" pad="PA00" ioset="3"/>
              <signal group="EXTINT" index="2" function="8" pad="PA04" ioset="3"/>
              <signal group="EXTINT" index="2" function="9" pad="PA08" ioset="3"/>
              <signal group="EXTINT" index="2" function="10" pad="PA12" ioset="3"/>
              <signal group="EXTINT" index="2" function="11" pad="PB01" ioset="3"/>
              <signal group="EXTINT" index="2" function="12" pad="PB05" ioset="3"/>
              <signal group="EXTINT" index="2" function="13" pad="PB09" ioset="3"/>
              <signal group="EXTINT" index="2" function="14" pad="PB13" ioset="3"/>
              <signal group="EXTINT" index="2" function="15" pad="PA01" ioset="3"/>
              <signal group="EXTINT" index="3" function="1" pad="PA06" ioset="4"/>
              <signal group="EXTINT" index="3" function="2" pad="PA10" ioset="4"/>
              <signal group="EXTINT" index="3" function="3" pad="PA14" ioset="4"/>
              <signal group="EXTINT" index="3" function="4" pad="PB03" ioset="4"/>
              <signal group="EXTINT" index="3" function="5" pad="PB07" ioset="4"/>
              <signal group="EXTINT" index="3" function="6" pad="PB11" ioset="4"/>
              <signal group="EXTINT" index="3" function="7" pad="PA01" ioset="4"/>
              <signal group="EXTINT" index="3" function="8" pad="PA05" ioset="4"/>
              <signal group="EXTINT" index="3" function="9" pad="PA09" ioset="4"/>
              <signal group="EXTINT" index="3" function="10" pad="PA13" ioset="4"/>
              <signal group="EXTINT" index="3" function="11" pad="PB02" ioset="4"/>
              <signal group="EXTINT" index="3" function="12" pad="PB06" ioset="4"/>
              <signal group="EXTINT" index="3" function="13" pad="PB10" ioset="4"/>
              <signal group="EXTINT" index="3" function="14" pad="PA08" ioset="4"/>
              <signal group="EXTINT" index="3" function="15" pad="PA02" ioset="4"/>
              <signal group="NMI" function="1" pad="PA06" ioset="4"/>
              <signal group="NMI" function="2" pad="PA10" ioset="4"/>
              <signal group="NMI" function="3" pad="PA14" ioset="4"/>
              <signal group="NMI" function="4" pad="PB03" ioset="4"/>
              <signal group="NMI" function="5" pad="PB07" ioset="4"/>
              <signal group="NMI" function="6" pad="PB11" ioset="4"/>
              <signal group="NMI" function="7" pad="PA01" ioset="4"/>
              <signal group="NMI" function="8" pad="PA05" ioset="4"/>
              <signal group="NMI" function="9" pad="PA09" ioset="4"/>
              <signal group="NMI" function="10" pad="PA13" ioset="4"/>
              <signal group="NMI" function="11" pad="PB02" ioset="4"/>
              <signal group="NMI" function="12" pad="PB06" ioset="4"/>
              <signal group="NMI" function="13" pad="PB10" ioset="4"/>
              <signal group="NMI" function="14" pad="PA08" ioset="4"/>
              <signal group="NMI" function="15" pad="PA02" ioset="4"/>
            </signals>
            <parameters>
              <param name="EXTINT_NUM" value="4"/>
              <param name="GCLK_ID" value="0"/>
              <param name="NUMBER_OF_CONFIG_REGS" value="2"/>
              <param name="NUMBER_OF_DPRESCALER_REGS" value="2"/>
              <param name="NUMBER_OF_INTERRUPTS" value="4"/>
              <param name="INSTANCE_ID" value="2"/>
            </parameters>
          </instance>
        </module>
        <module name="EVSYS" id="U2504" version="1.0.0">
          <instance name="EVSYS">
            <register-group name="EVSYS" name-in-module="EVSYS" address-space="base" offset="0x41006000"/>
            <parameters>
              <param name="ASYNCHRONOUS_CHANNELS" value="0xFFFFF000"/>
              <param name="CHANNELS" value="32" caption="Total Number of Channels"/>
              <param name="CHANNELS_BITS" value="5" caption="Number of bits to select Channel"/>
              <param name="EXTEVT_NUM" value="0" caption="Number of External Event Generators"/>
              <param name="GCLK_ID_0" value="8" caption="Index of Generic Clock 0"/>
              <param name="GCLK_ID_1" value="9" caption="Index of Generic Clock 1"/>
              <param name="GCLK_ID_2" value="10" caption="Index of Generic Clock 2"/>
              <param name="GCLK_ID_3" value="11" caption="Index of Generic Clock 3"/>
              <param name="GCLK_ID_4" value="12" caption="Index of Generic Clock 4"/>
              <param name="GCLK_ID_5" value="13" caption="Index of Generic Clock 5"/>
              <param name="GCLK_ID_6" value="14" caption="Index of Generic Clock 6"/>
              <param name="GCLK_ID_7" value="15" caption="Index of Generic Clock 7"/>
              <param name="GCLK_ID_8" value="16" caption="Index of Generic Clock 8"/>
              <param name="GCLK_ID_9" value="17" caption="Index of Generic Clock 9"/>
              <param name="GCLK_ID_10" value="18" caption="Index of Generic Clock 10"/>
              <param name="GCLK_ID_11" value="19" caption="Index of Generic Clock 11"/>
              <param name="GENERATORS" value="69" caption="Total Number of Event Generators"/>
              <param name="GENERATORS_BITS" value="7" caption="Number of bits to select Event Generator"/>
              <param name="SYNCH_NUM" value="12" caption="Number of Synchronous Channels"/>
              <param name="SYNCH_NUM_BITS" value="4" caption="Number of bits to select Synchronous Channels"/>
              <param name="USERS" value="52" caption="Total Number of Event Users"/>
              <param name="USERS_BITS" value="6" caption="Number of bits to select Event User"/>
              <param name="INSTANCE_ID" value="35"/>
            </parameters>
          </instance>
        </module>
        <module name="NVM" id="03140" version="1.0">
          <instance name="NVM">
            <register-group name="NVM" name-in-module="NVM" address-space="base" offset="0x44000600"/>
            <parameters>
              <param name="PAGE_SIZE" value="4096"/>
              <param name="ROW_SIZE" value="1024"/>
            </parameters>
          </instance>
        </module>
