Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.107/BZ25/atdf/PIC32CX1012BZ25048.atdf
      <value-group caption="Global Software Trigger bit" name="ADCCON3__GSWTRG">
        <value caption="Trigger conversion for ADC inputs that have selected the GSWTRG bit as either through the associated TRGSRC bits in the ADCTRGx registers or through the STRGSRC&lt;4:0&gt; bits in the ADCCON1 register the trigger signal" name="GSWTRG" value="0x1"/>
        <value caption="Do not trigger an analog-to-digital conversion" name="NO_GSWTRG" value="0x0"/>
      </value-group>
      <value-group caption="Global Level Software Trigger bit" name="ADCCON3__GLSWTRG">
        <value caption="Trigger conversion for ADC inputs that have selected the GLSWTRG bit as the trigger signal" name="GLSWTRG" value="0x1"/>
        <value caption="Do not trigger an analog-to-digital conversion" name="NO_GLSWTRG" value="0x0"/>
      </value-group>
      <value-group caption="Individual ADC Input Conversion Request bit" name="ADCCON3__RQCNVRT">
        <value caption="Trigger the conversion of the selected ADC input as specified by the ADINSEL bits" name="IND_TRIGGER" value="0x1"/>
        <value caption="Do not trigger the conversion" name="NO_TRIGGER" value="0x0"/>
      </value-group>
      <value-group caption="Shared ADC7 Analog Input Sampling Enable bit " name="ADCCON3__SAMP">
        <value caption="The ADC S&amp;H amplifier is sampling" name="SAMPLE" value="0x1"/>
        <value caption="The ADC S&amp;H amplifier is holding" name="HOLD" value="0x0"/>
      </value-group>
      <value-group caption="ADC Update Ready Status bit" name="ADCCON3__UPDRDY">
        <value caption="ADC SFRs can be updated" name="UPDATE_RDY" value="0x1"/>
        <value caption="ADC SFRs cannot be updated" name="UPDATE_NOT_RDY" value="0x0"/>
      </value-group>
      <value-group caption="Update Ready Interrupt Enable bit" name="ADCCON3__UPDIEN">
        <value caption="Interrupt will be generated when the UPDRDY bit is set by hardware" name="INT_ON_UPDATE_RDY" value="0x1"/>
        <value caption="No interrupt is generated" name="NO_INT_ON_UPDATE_RDY" value="0x0"/>
      </value-group>
      <value-group caption="Trigger Suspend bit" name="ADCCON3__TRGSUSP">
        <value caption="Triggers are blocked from starting a new analog-to-digital conversion" name="TRIG_BLOCKED" value="0x1"/>
        <value caption="Triggers are not blocked" name="TRIG_NOT_BLOCKED" value="0x0"/>
      </value-group>
      <value-group caption="Voltage Reference Input Selection bits" name="ADCCON3__VREFSEL">
        <value caption="ADC VREFH is AVDD, ADC VREFL is AVSS" name="AVDD_AVSS" value="0x0"/>
      </value-group>
      <value-group caption="Analog-to-Digital Clock Source bits" name="ADCCON3__ADCSEL">
        <value caption="SYSCLK" name="SYSCLK" value="0x3"/>
        <value caption="REFCLK3" name="REFCLK3" value="0x2"/>
        <value caption="FRC" name="FRC" value="0x1"/>
        <value caption="PBCLK1" name="PBCLK1" value="0x0"/>
      </value-group>
      <value-group caption="Trigger Source for Conversion of ADC0 Module Select bits" name="ADCTRG1__TRGSRC0">
        <value caption="RESERVED" name="RESERVED" value="0x1f"/>
        <value caption="ADC_TRIG_16" name="EVSYS_47" value="0x10"/>
        <value caption="ADC_TRIG_15" name="EVSYS_46" value="0xf"/>
        <value caption="ADC_TRIG_14" name="EVSYS_45" value="0xe"/>
        <value caption="ADC_TRIG_13" name="EVSYS_44" value="0xd"/>
        <value caption="ADC_TRIG_12" name="EVSYS_43" value="0xc"/>
        <value caption="ADC_TRIG_11" name="EVSYS_42" value="0xb"/>
        <value caption="ADC_TRIG_10" name="EVSYS_41" value="0xa"/>
        <value caption="ADC_TRIG_9" name="EVSYS_40" value="0x9"/>
        <value caption="ADC_TRIG_8" name="EVSYS_39" value="0x8"/>
        <value caption="ADC_TRIG_7" name="EVSYS_38" value="0x7"/>
        <value caption="ADC_TRIG_6" name="EVSYS_37" value="0x6"/>
        <value caption="ADC_TRIG_5" name="EVSYS_36" value="0x5"/>
        <value caption="INT0" name="INT0" value="0x4"/>
        <value caption="Scan trigger" name="SCAN_TRIG" value="0x3"/>
        <value caption="Software level trigger" name="SW_LVL" value="0x2"/>
        <value caption="Software edge trigger" name="SW_EDGE" value="0x1"/>
        <value caption="No Trigger" name="NONE" value="0x0"/>
      </value-group>
      <value-group caption="Trigger Source for Conversion of ADC1 Module Select bits" name="ADCTRG1__TRGSRC1">
        <value caption="RESERVED" name="RESERVED" value="0x1f"/>
        <value caption="ADC_TRIG_16" name="EVSYS_47" value="0x10"/>
        <value caption="ADC_TRIG_15" name="EVSYS_46" value="0xf"/>
        <value caption="ADC_TRIG_14" name="EVSYS_45" value="0xe"/>
        <value caption="ADC_TRIG_13" name="EVSYS_44" value="0xd"/>
        <value caption="ADC_TRIG_12" name="EVSYS_43" value="0xc"/>
        <value caption="ADC_TRIG_11" name="EVSYS_42" value="0xb"/>
        <value caption="ADC_TRIG_10" name="EVSYS_41" value="0xa"/>
        <value caption="ADC_TRIG_9" name="EVSYS_40" value="0x9"/>
        <value caption="ADC_TRIG_8" name="EVSYS_39" value="0x8"/>
        <value caption="ADC_TRIG_7" name="EVSYS_38" value="0x7"/>
        <value caption="ADC_TRIG_6" name="EVSYS_37" value="0x6"/>
        <value caption="ADC_TRIG_5" name="EVSYS_36" value="0x5"/>
        <value caption="INT0" name="INT0" value="0x4"/>
        <value caption="Scan trigger" name="SCAN_TRIG" value="0x3"/>
        <value caption="Software level trigger" name="SW_LVL" value="0x2"/>
        <value caption="Software edge trigger" name="SW_EDGE" value="0x1"/>
        <value caption="No Trigger" name="NONE" value="0x0"/>
      </value-group>
      <value-group caption="Trigger Source for Conversion of ADC2 Module Select bits" name="ADCTRG1__TRGSRC2">
        <value caption="RESERVED" name="RESERVED" value="0x1f"/>
        <value caption="ADC_TRIG_16" name="EVSYS_47" value="0x10"/>
        <value caption="ADC_TRIG_15" name="EVSYS_46" value="0xf"/>
        <value caption="ADC_TRIG_14" name="EVSYS_45" value="0xe"/>
        <value caption="ADC_TRIG_13" name="EVSYS_44" value="0xd"/>
        <value caption="ADC_TRIG_12" name="EVSYS_43" value="0xc"/>
        <value caption="ADC_TRIG_11" name="EVSYS_42" value="0xb"/>
        <value caption="ADC_TRIG_10" name="EVSYS_41" value="0xa"/>
        <value caption="ADC_TRIG_9" name="EVSYS_40" value="0x9"/>
        <value caption="ADC_TRIG_8" name="EVSYS_39" value="0x8"/>
        <value caption="ADC_TRIG_7" name="EVSYS_38" value="0x7"/>
        <value caption="ADC_TRIG_6" name="EVSYS_37" value="0x6"/>
        <value caption="ADC_TRIG_5" name="EVSYS_36" value="0x5"/>
        <value caption="INT0" name="INT0" value="0x4"/>
        <value caption="Scan trigger" name="SCAN_TRIG" value="0x3"/>
        <value caption="Software level trigger" name="SW_LVL" value="0x2"/>
        <value caption="Software edge trigger" name="SW_EDGE" value="0x1"/>
        <value caption="No Trigger" name="NONE" value="0x0"/>
      </value-group>
      <value-group caption="Trigger Source for Conversion of ADC3 Module Select bits" name="ADCTRG1__TRGSRC3">
        <value caption="RESERVED" name="RESERVED" value="0x1f"/>
        <value caption="ADC_TRIG_16" name="EVSYS_47" value="0x10"/>
        <value caption="ADC_TRIG_15" name="EVSYS_46" value="0xf"/>
        <value caption="ADC_TRIG_14" name="EVSYS_45" value="0xe"/>
        <value caption="ADC_TRIG_13" name="EVSYS_44" value="0xd"/>
        <value caption="ADC_TRIG_12" name="EVSYS_43" value="0xc"/>
        <value caption="ADC_TRIG_11" name="EVSYS_42" value="0xb"/>
        <value caption="ADC_TRIG_10" name="EVSYS_41" value="0xa"/>
        <value caption="ADC_TRIG_9" name="EVSYS_40" value="0x9"/>
        <value caption="ADC_TRIG_8" name="EVSYS_39" value="0x8"/>
        <value caption="ADC_TRIG_7" name="EVSYS_38" value="0x7"/>
        <value caption="ADC_TRIG_6" name="EVSYS_37" value="0x6"/>
        <value caption="ADC_TRIG_5" name="EVSYS_36" value="0x5"/>
        <value caption="INT0" name="INT0" value="0x4"/>
        <value caption="Scan trigger" name="SCAN_TRIG" value="0x3"/>
        <value caption="Software level trigger" name="SW_LVL" value="0x2"/>
        <value caption="Software edge trigger" name="SW_EDGE" value="0x1"/>
        <value caption="No Trigger" name="NONE" value="0x0"/>
      </value-group>
      <value-group caption="Trigger Source for Conversion of ADC4 Module Select bits" name="ADCTRG2__TRGSRC4">
        <value caption="RESERVED" name="RESERVED" value="0x1f"/>
        <value caption="ADC_TRIG_16" name="EVSYS_47" value="0x10"/>
        <value caption="ADC_TRIG_15" name="EVSYS_46" value="0xf"/>
        <value caption="ADC_TRIG_14" name="EVSYS_45" value="0xe"/>
        <value caption="ADC_TRIG_13" name="EVSYS_44" value="0xd"/>
        <value caption="ADC_TRIG_12" name="EVSYS_43" value="0xc"/>
        <value caption="ADC_TRIG_11" name="EVSYS_42" value="0xb"/>
        <value caption="ADC_TRIG_10" name="EVSYS_41" value="0xa"/>
        <value caption="ADC_TRIG_9" name="EVSYS_40" value="0x9"/>
        <value caption="ADC_TRIG_8" name="EVSYS_39" value="0x8"/>
        <value caption="ADC_TRIG_7" name="EVSYS_38" value="0x7"/>
        <value caption="ADC_TRIG_6" name="EVSYS_37" value="0x6"/>
        <value caption="ADC_TRIG_5" name="EVSYS_36" value="0x5"/>
        <value caption="INT0" name="INT0" value="0x4"/>
        <value caption="Scan trigger" name="SCAN_TRIG" value="0x3"/>
        <value caption="Software level trigger" name="SW_LVL" value="0x2"/>
        <value caption="Software edge trigger" name="SW_EDGE" value="0x1"/>
        <value caption="No Trigger" name="NONE" value="0x0"/>
      </value-group>
      <value-group caption="Trigger Source for Conversion of ADC5 Module Select bits" name="ADCTRG2__TRGSRC5">
        <value caption="RESERVED" name="RESERVED" value="0x1f"/>
        <value caption="ADC_TRIG_16" name="EVSYS_47" value="0x10"/>
        <value caption="ADC_TRIG_15" name="EVSYS_46" value="0xf"/>
        <value caption="ADC_TRIG_14" name="EVSYS_45" value="0xe"/>
        <value caption="ADC_TRIG_13" name="EVSYS_44" value="0xd"/>
        <value caption="ADC_TRIG_12" name="EVSYS_43" value="0xc"/>
        <value caption="ADC_TRIG_11" name="EVSYS_42" value="0xb"/>
        <value caption="ADC_TRIG_10" name="EVSYS_41" value="0xa"/>
        <value caption="ADC_TRIG_9" name="EVSYS_40" value="0x9"/>
        <value caption="ADC_TRIG_8" name="EVSYS_39" value="0x8"/>
        <value caption="ADC_TRIG_7" name="EVSYS_38" value="0x7"/>
        <value caption="ADC_TRIG_6" name="EVSYS_37" value="0x6"/>
        <value caption="ADC_TRIG_5" name="EVSYS_36" value="0x5"/>
        <value caption="INT0" name="INT0" value="0x4"/>
        <value caption="Scan trigger" name="SCAN_TRIG" value="0x3"/>
        <value caption="Software level trigger" name="SW_LVL" value="0x2"/>
        <value caption="Software edge trigger" name="SW_EDGE" value="0x1"/>
        <value caption="No Trigger" name="NONE" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS0">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN0" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN0" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS1">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN1" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN1" value="0x0"/>
      </value-group>
