Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.107/BZ25/atdf/PIC32CX1012BZ25048.atdf
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS2">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN2" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN2" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS3">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN3" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN3" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS4">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN4" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN4" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS5">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN5" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN5" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS6">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN6" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN6" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS7">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN7" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN7" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS8">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN8" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN8" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS9">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN9" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN9" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS10">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN10" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN10" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits" name="ADCCSS1__CSS11">
        <value caption="Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)" name="SEL_AN11" value="0x1"/>
        <value caption="Skip ANx for input scan" name="SKIP_AN11" value="0x0"/>
      </value-group>
      <value-group caption="AN0 Signed Data Mode bit" name="ADCIMCON1__SIGN0">
        <value caption="AN0 is using Signed Data mode" name="SIGNED" value="0x1"/>
        <value caption="AN0 is using Unsigned Data mode" name="UNSIGNED" value="0x0"/>
      </value-group>
      <value-group caption="AN0 Mode bit" name="ADCIMCON1__DIFF0">
        <value caption="Selects AN0 differential input pair as AN0+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN0 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
      <value-group caption="AN1 Signed Data Mode bit" name="ADCIMCON1__SIGN1">
        <value caption="AN1 is using Signed Data mode" name="SIGNED" value="0x1"/>
        <value caption="AN1 is using Unsigned Data mode" name="UNSIGNED" value="0x0"/>
      </value-group>
      <value-group caption="AN1 Mode bit" name="ADCIMCON1__DIFF1">
        <value caption="Selects AN1 differential input pair as AN1+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN1 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
      <value-group caption="AN2 Signed Data Mode bit" name="ADCIMCON1__SIGN2">
        <value caption="AN2 is using Signed Data mode" name="SIGNED" value="0x1"/>
        <value caption="AN2 is using Unsigned Data mode" name="UNSIGNED" value="0x0"/>
      </value-group>
      <value-group caption="AN2 Mode bit" name="ADCIMCON1__DIFF2">
        <value caption="Selects AN2 differential input pair as AN2+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN2 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
      <value-group caption="AN3 Signed Data Mode bit" name="ADCIMCON1__SIGN3">
        <value caption="AN3 is using Signed Data mode" name="SIGNED" value="0x1"/>
        <value caption="AN3 is using Unsigned Data mode" name="UNSIGNED" value="0x0"/>
      </value-group>
      <value-group caption="AN3 Mode bit" name="ADCIMCON1__DIFF3">
        <value caption="Selects AN3 differential input pair as AN3+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN3 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
      <value-group caption="AN4 Signed Data Mode bit" name="ADCIMCON1__SIGN4">
        <value caption="AN4 is using Signed Data mode" name="SIGNED" value="0x1"/>
        <value caption="AN4 is using Unsigned Data mode" name="UNSIGNED" value="0x0"/>
      </value-group>
      <value-group caption="AN4 Mode bit" name="ADCIMCON1__DIFF4">
        <value caption="Selects AN4 differential input pair as AN4+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN4 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
      <value-group caption="AN5 Signed Data Mode bit" name="ADCIMCON1__SIGN5">
        <value caption="AN5 is using Signed Data mode" name="SIGNED" value="0x1"/>
        <value caption="AN5 is using Unsigned Data mode" name="UNSIGNED" value="0x0"/>
      </value-group>
      <value-group caption="AN5 Mode bit" name="ADCIMCON1__DIFF5">
        <value caption="Selects AN5 differential input pair as AN5+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN5 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
      <value-group caption="AN6 Signed Data Mode bit" name="ADCIMCON1__SIGN6">
        <value caption="AN6 is using Signed Data mode" name="SIGNED" value="0x1"/>
        <value caption="AN6 is using Unsigned Data mode" name="UNSIGNED" value="0x0"/>
      </value-group>
      <value-group caption="AN6 Mode bit" name="ADCIMCON1__DIFF6">
        <value caption="Selects AN6 differential input pair as AN6+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN6 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
      <value-group caption="AN7 Signed Data Mode bit" name="ADCIMCON1__SIGN7">
        <value caption="AN7 is using Signed Data mode" name="SIGNED" value="0x1"/>
        <value caption="AN7 is using Unsigned Data mode" name="UNSIGNED" value="0x0"/>
      </value-group>
