Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.107/BZ25/atdf/PIC32CX1012BZ25048.atdf
        <register name="CFGPCLKGEN3" offset="0x80" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="EVSYSC9SEL" caption="EVSYSC9 Peripheral Clock Selection" mask="0x7" values="PCLKGENSEL"/>
          <bitfield name="C9D" caption="C9D Clock Disable" mask="0x8" values="PGCLK__CTRL"/>
          <bitfield name="EVSYSC10SEL" caption="EVSYSC10 Peripheral Clock Selection" mask="0x70" values="PCLKGENSEL"/>
          <bitfield name="C10D" caption="C10D Clock Disable" mask="0x80" values="PGCLK__CTRL"/>
          <bitfield name="EVSYSC11SEL" caption="EVSYSC11 Peripheral Clock Selection" mask="0x700" values="PCLKGENSEL"/>
          <bitfield name="C11D" caption="C11D Clock Disable" mask="0x800" values="PGCLK__CTRL"/>
          <bitfield name="EVSYSC12SEL" caption="EVSYSC12 Peripheral Clock Selection" mask="0x7000" values="PCLKGENSEL"/>
          <bitfield name="C12D" caption="C12D Clock Disable" mask="0x8000" values="PGCLK__CTRL"/>
          <bitfield name="ACCLKSEL" caption="AC Peripheral Clock Selection" mask="0x70000" values="PCLKGENSEL"/>
          <bitfield name="ACCD" caption="AC Clock Disable" mask="0x80000" values="PGCLK__CTRL"/>
          <bitfield name="TCC0CSEL" caption="TCC0 Peripheral Clock Selection" mask="0x700000" values="PCLKGENSEL"/>
          <bitfield name="TCC0CD" caption="TCC0 Clock Disable" mask="0x800000" values="PGCLK__CTRL"/>
          <bitfield name="TC0CSEL" caption="TC0 Peripheral Clock Selection" mask="0x7000000" values="PCLKGENSEL"/>
          <bitfield name="TC0CD" caption="TC0 Clock Disable" mask="0x8000000" values="PGCLK__CTRL"/>
          <bitfield name="TC1CSEL" caption="TC1 Peripheral Clock Selection" mask="0x70000000" values="PCLKGENSEL"/>
          <bitfield name="TC1CD" caption="TC1 Clock Disable" mask="0x80000000" values="PGCLK__CTRL"/>
        </register>
        <register name="ID" offset="0x90" rw="R" size="4" access-size="4" initval="0x00000000" caption="Device ID"/>
        <register name="USER_ID" offset="0xa0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="USER_ID" caption="User unique ID, readable using the JTAG USER_ID instruction" mask="0xffff"/>
        </register>
        <register name="SYSKEY" offset="0xb0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SYSKEY" caption="System Key" mask="0xffffffff"/>
        </register>
        <register name="PMD1" offset="0xc0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="ZBMD" caption="ZigBee Module Disable" mask="0x1"/>
          <bitfield name="BTMD" caption="Bluetooth Module Disable" mask="0x2"/>
          <bitfield name="MPAMD" caption="RF MPA Module Disable" mask="0x4"/>
          <bitfield name="LPAMD" caption="RF LPA Module Disable" mask="0x8"/>
          <bitfield name="PLVDMD" caption="PLVD Module Disable" mask="0x10"/>
          <bitfield name="ACMD" caption="AC Module Disable" mask="0x40"/>
          <bitfield name="ADCMD" caption="ADC Controller Module Disable" mask="0x80"/>
          <bitfield name="ADCSARMD" caption="Shared ADC SAR Core Module Disable" mask="0x100"/>
          <bitfield name="RTCCMD" caption="RTCC Module Disable" mask="0x10000"/>
          <bitfield name="SQIMD" caption="SQI Module Disable" mask="0x20000000"/>
        </register>
        <register name="PMD2" offset="0xd0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="REFO5MD" caption="Reference (Clock) Out 5 Module Disable" mask="0x1000000"/>
          <bitfield name="REFO6MD" caption="Reference (Clock) Out 6 Module Disable" mask="0x2000000"/>
          <bitfield name="REFO1MD" caption="Reference (Clock) Out 1 Module Disable" mask="0x10000000"/>
          <bitfield name="REFO2MD" caption="Reference (Clock) Out 2 Module Disable" mask="0x20000000"/>
          <bitfield name="REFO3MD" caption="Reference (Clock) Out 3 Module Disable" mask="0x40000000"/>
          <bitfield name="REFO4MD" caption="Reference (Clock) Out 4 Module Disable" mask="0x80000000"/>
        </register>
        <register name="PMD3" offset="0xe0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SER1MD" caption="SERCOM1 Module Disable" mask="0x1"/>
          <bitfield name="SER2MD" caption="SERCOM2 Module Disable" mask="0x2"/>
          <bitfield name="SER3MD" caption="SERCOM3 Module Disable" mask="0x4"/>
          <bitfield name="SER4MD" caption="SERCOM4 Module Disable" mask="0x8"/>
          <bitfield name="ICMMD" caption="ICM Module Disable" mask="0x10"/>
          <bitfield name="PUKCCMD" caption="PUKCC Module Disable" mask="0x20"/>
          <bitfield name="RNGMD" caption="TRNG Module Disable" mask="0x40"/>
          <bitfield name="AESMD" caption="AES Module Disable" mask="0x80"/>
          <bitfield name="TC0MD" caption="TC0 Module Disable" mask="0x100"/>
          <bitfield name="TC1MD" caption="TC1 Module Disable" mask="0x200"/>
          <bitfield name="TC2MD" caption="TC2 Module Disable" mask="0x400"/>
          <bitfield name="TC3MD" caption="TC3 Module Disable" mask="0x800"/>
          <bitfield name="TCC0MD" caption="TCC0 Module Disable" mask="0x1000"/>
          <bitfield name="TCC1MD" caption="TCC1 Module Disable" mask="0x2000"/>
          <bitfield name="TCC2MD" caption="TCC2 Module Disable" mask="0x4000"/>
        </register>
        <register name="MISCSTAT" offset="0x100" rw="RW" size="4" access-size="4" initval="0x01000081" caption="">
          <bitfield name="CLDORDY" caption="CLDO Ready" mask="0x200"/>
        </register>
        <register name="BCFG0" offset="0x200" rw="R" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="PCSCMODE" caption="PCHE Single cache Mode" mask="0x2"/>
          <bitfield name="CP" caption="Boot Code Protect" mask="0x10000000"/>
          <bitfield name="SIGN" caption="Flash SIGN" mask="0x20000000"/>
          <bitfield name="BINFOVALID0" caption="First 256-bit BCFG information Valid" mask="0x80000000"/>
        </register>
        <register name="CFGCON0CLR" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="CFGCON0SET" offset="0x8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="CFGCON0INV" offset="0xc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
