Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.107/BZ25/atdf/PIC32CX1012BZ25048.atdf
        <register name="CFGCON1CLR" offset="0x14" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="CFGCON1SET" offset="0x18" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="CFGCON1INV" offset="0x1c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="CFGCON2CLR" offset="0x24" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="CFGCON2SET" offset="0x28" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="CFGCON2INV" offset="0x2c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="CFGCON4CLR" offset="0x44" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="CFGCON4SET" offset="0x48" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="CFGCON4INV" offset="0x4c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="CFGPGQOSCLR" offset="0x54" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="CFGPGQOSSET" offset="0x58" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="CFGPGQOSINV" offset="0x5c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="CFGPCLKGEN1CLR" offset="0x64" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="CFGPCLKGEN1SET" offset="0x68" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="CFGPCLKGEN1INV" offset="0x6c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="CFGPCLKGEN2CLR" offset="0x74" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="CFGPCLKGEN2SET" offset="0x78" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="CFGPCLKGEN2INV" offset="0x7c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="CFGPCLKGEN3CLR" offset="0x84" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="CFGPCLKGEN3SET" offset="0x88" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="CFGPCLKGEN3INV" offset="0x8c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="USER_IDCLR" offset="0xa4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="USER_IDSET" offset="0xa8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="USER_IDINV" offset="0xac" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="PMD1CLR" offset="0xc4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="PMD1SET" offset="0xc8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="PMD1INV" offset="0xcc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="PMD2CLR" offset="0xd4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="PMD2SET" offset="0xd8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="PMD2INV" offset="0xdc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="PMD3CLR" offset="0xe4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="PMD3SET" offset="0xe8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="PMD3INV" offset="0xec" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
      </register-group>
      <value-group name="PCLKGENSEL">
        <value name="NO_CLK" caption="No Clock" value="0x0"/>
        <value name="REFO1" caption="Reference Clock 1" value="0x1"/>
        <value name="REFO2" caption="Reference Clock 2" value="0x2"/>
        <value name="REFO3" caption="Reference Clock 3" value="0x3"/>
        <value name="REFO4" caption="Reference Clock 4" value="0x4"/>
        <value name="REFO5" caption="Reference Clock 5" value="0x5"/>
        <value name="REFO6" caption="Reference Clock 6" value="0x6"/>
        <value name="LPCLK" caption="32 KHz Low Power Clock" value="0x7"/>
      </value-group>
      <value-group caption="PGCLK Control" name="PGCLK__CTRL">
        <value caption="Enable PGCLK" name="ON" value="0x1"/>
        <value caption="Disable PGCLK" name="OFF" value="0x0"/>
      </value-group>
    </module>
    <module name="CMCC" id="U2015" version="6.0.0" caption="Cortex M Cache Controller">
      <register-group name="CMCC" caption="Cortex M Cache Controller">
        <register name="TYPE" offset="0x0" rw="R" size="4" access-size="4" initval="0x000012D2" caption="Cache Type Register">
          <bitfield name="GCLK" caption="dynamic Clock Gating supported" mask="0x2"/>
          <bitfield name="RRP" caption="Round Robin Policy supported" mask="0x10"/>
          <bitfield name="WAYNUM" caption="Number of Way" mask="0x60" values="CMCC_TYPE__WAYNUM"/>
          <bitfield name="LCKDOWN" caption="Lock Down supported" mask="0x80"/>
          <bitfield name="CSIZE" caption="Cache Size" mask="0x700" values="CMCC_TYPE__CSIZE"/>
          <bitfield name="CLSIZE" caption="Cache Line Size" mask="0x3800" values="CMCC_TYPE__CLSIZE"/>
        </register>
        <register name="CFG" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000020" caption="Cache Configuration Register">
          <bitfield name="ICDIS" caption="Instruction Cache Disable" mask="0x2"/>
          <bitfield name="DCDIS" caption="Data Cache Disable" mask="0x4"/>
          <bitfield name="CSIZESW" caption="Cache size configured by software" mask="0x70" values="CMCC_CFG__CSIZESW"/>
        </register>
        <register name="CTRL" offset="0x8" rw="W" size="4" access-size="4" initval="0x00000000" caption="Cache Control Register">
          <bitfield name="CEN" caption="Cache Controller Enable" mask="0x1"/>
        </register>
        <register name="SR" offset="0xC" rw="R" size="4" access-size="4" initval="0x00000000" caption="Cache Status Register">
          <bitfield name="CSTS" caption="Cache Controller Status" mask="0x1"/>
        </register>
        <register name="LCKWAY" offset="0x10" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Cache Lock per Way Register">
          <bitfield name="LCKWAY" caption="Lockdown way Register" mask="0xF"/>
        </register>
        <register name="MAINT0" offset="0x20" rw="W" size="4" access-size="4" initval="0x00000000" caption="Cache Maintenance Register 0">
          <bitfield name="INVALL" caption="Cache Controller invalidate All" mask="0x1"/>
        </register>
        <register name="MAINT1" offset="0x24" rw="W" size="4" access-size="4" initval="0x00000000" caption="Cache Maintenance Register 1">
          <bitfield name="INDEX" caption="Invalidate Index" mask="0xFF0"/>
          <bitfield name="WAY" caption="Invalidate Way" mask="0xF0000000" values="CMCC_MAINT1__WAY"/>
        </register>
        <register name="MCFG" offset="0x28" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Cache Monitor Configuration Register">
          <bitfield name="MODE" caption="Cache Controller Monitor Counter Mode" mask="0x3" values="CMCC_MCFG__MODE"/>
        </register>
