Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.107/BZ25/atdf/PIC32CX1012BZ25048.atdf
        <register name="FCPN0" initval="0x10000000" offset="0x13C" size="4" rw="RW" caption="NVR CPN Register">
          <bitfield caption="Boot Code Protect" mask="0x10000000" name="CP" values="FCPN0__CP"/>
        </register>
        <!-- Alternative backup config locations -->
        <register name="ALTFBCFG7" initval="0xFFFFFFFF" offset="0x0" size="4" rw="RW" caption="RESERVED"/>
        <register name="ALTFBCFG6" initval="0xFFFFFFFF" offset="0x4" size="4" rw="RW" caption="RESERVED"/>
        <register name="ALTFUSERID" initval="0x0000FFFF" offset="0x8" size="4" rw="RW" caption="ALT USERID"/>
        <register name="ALTDEVCFG4" initval="0x840e4000" offset="0xC" size="4" rw="RW" caption="ALT CFGCON4 Fuses"/>
        <register name="ALTDEVCFG2" initval="0x5f74ff38" offset="0x10" size="4" rw="RW" caption="ALT CFGCON2 Fuses"/>
        <register name="ALTDEVCFG1" initval="0x1410443b" offset="0x14" size="4" rw="RW" caption="ALT CFGCON1 Fuses"/>
        <register name="ALTDEVCFG0" initval="0x7100000b" offset="0x18" size="4" rw="RW" caption="ALT CFGCON0 Fuses"/>
        <register name="ALTFBCFG0" initval="0x80000002" offset="0x1C" size="4" rw="RW" caption="ALT NVR BCFG0"/>
        <register name="ALTFCPN3" initval="0xFFFFFFFF" offset="0x30" size="4" rw="RW" caption="RESERVED"/>
        <register name="ALTFCPN2" initval="0xFFFFFFFF" offset="0x34" size="4" rw="RW" caption="RESERVED"/>
        <register name="ALTFCPN1" initval="0xFFFFFFFF" offset="0x38" size="4" rw="RW" caption="RESERVED"/>
        <register name="ALTFCPN0" initval="0x10000000" offset="0x3C" size="4" rw="RW" caption="ALT NVR CPN Register"/>
      </register-group>
      <!-- DEVCFG0 -->
      <value-group name="DEVCFG0__TDOEN">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__SWOEN">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__TROEN">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__ADCPOVR">
        <value name="HW" caption="" value="0x0"/>
        <value name="SW" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__GPSOSCE">
        <value name="GPIO" caption="" value="0x0"/>
        <value name="SOSC" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__ACCMP1_ALTEN">
        <value name="PA6" caption="" value="0x1"/>
        <value name="PA1" caption="" value="0x0"/>
      </value-group>
      <value-group name="DEVCFG0__CPENFILT">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__RTCIN0_ALTEN">
        <value name="PA3" caption="" value="0x0"/>
        <value name="PA9" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__RTCOUT_ALTEN">
        <value name="PA4" caption="" value="0x0"/>
        <value name="PA10" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__VBCMODE">
        <value name="DIRECT" caption="" value="0x0"/>
        <value name="INDIR" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__SMBUSEN0">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__SMBUSEN1">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__SMBUSEN2">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__HPLUGDIS">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__SLRTEN0">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__SLRTEN1">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__SLRTEN2">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__PCM">
        <value name="CPU" caption="" value="0x0"/>
        <value name="SFR" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__INT0E">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__INT0P">
        <value name="NEG" caption="" value="0x0"/>
        <value name="POS" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__FECCCON">
        <value name="ON" caption="" value="0x0"/>
        <value name="DYNAMIC" caption="" value="0x1"/>
        <value name="OFF" caption="" value="0x3"/>
      </value-group>
      <value-group name="DEVCFG0__FRECCDIS">
        <value name="OFF" caption="" value="0x1"/>
        <value name="ON" caption="" value="0x0"/>
      </value-group>
      <!-- DEVCFG1 -->
      <value-group name="DEVCFG1__ICESEL">
        <value name="PGC4_PGD4" caption="" value="0x0"/>
        <value name="NOT_USED" caption="" value="0x1"/>
        <value name="PGC2_PGD2" caption="" value="0x2"/>
        <value name="PGC1_PGD1" caption="" value="0x3"/>
      </value-group>
      <value-group name="DEVCFG1__TRCEN">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG1__ZBTWKSYS">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG1__CMP0_OE">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG1__CMP1_OE">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG1__CLASSBDIS">
        <value name="ON" caption="" value="0x0"/>
        <value name="OFF" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG1__SLRCTRL0">
        <value name="GPIO" caption="" value="0x0"/>
        <value name="SERCOM" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG1__SLRCTRL1">
        <value name="GPIO" caption="" value="0x0"/>
        <value name="SERCOM" caption="" value="0x1"/>
      </value-group>
