Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.107/BZ25/atdf/PIC32CX1012BZ25048.atdf
        <register name="IFT_ECCFLT" offset="0xA0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="FLT1PTR" caption="" mask="0x1ff"/>
          <bitfield name="FLT2PTR" caption="" mask="0x1ff0000"/>
        </register>
        <register name="IFT_ECCADR" offset="0xB0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="ECCADR" caption="" mask="0xffffffff"/>
        </register>
        <register name="IFT_ECCPAR" offset="0xC0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SECIN" caption="" mask="0x1ff"/>
          <bitfield name="DEDIN" caption="" mask="0x8000"/>
          <bitfield name="SECOUT" caption="" mask="0x1ff0000"/>
          <bitfield name="DEDOUT" caption="" mask="0x80000000"/>
        </register>
        <register name="IFT_ECCSYN" offset="0xD0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SECSYN" caption="" mask="0x1ff"/>
          <bitfield name="DEDSYS" caption="" mask="0x8000"/>
          <bitfield name="SERR" caption="" mask="0x10000"/>
          <bitfield name="DERR" caption="" mask="0x20000"/>
          <bitfield name="CERR" caption="" mask="0x40000"/>
          <bitfield name="CTLSTAT" caption="" mask="0x7000000"/>
          <bitfield name="PERR0" caption="" mask="0x10000000"/>
          <bitfield name="PERR1" caption="" mask="0x20000000"/>
          <bitfield name="PERR2" caption="" mask="0x40000000"/>
          <bitfield name="PERR3" caption="" mask="0x80000000"/>
        </register>
        <register name="DFT_VALCON" offset="0xF0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="VAL_ON" caption="" mask="0x8000"/>
        </register>
        <register name="DFT_VALP1RR01" offset="0x100" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="PR1RR0" caption="" mask="0xffff"/>
          <bitfield name="P1RR1" caption="" mask="0xffff0000"/>
        </register>
        <register name="DFT_VALP1RR23" offset="0x110" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="PR1RR2" caption="" mask="0xffff"/>
          <bitfield name="P1RR3" caption="" mask="0xffff0000"/>
        </register>
        <register name="DFT_VALP1RR45" offset="0x120" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="PR1RR4" caption="" mask="0xffff"/>
          <bitfield name="P1RR5" caption="" mask="0xffff0000"/>
        </register>
        <register name="DFT_VALP1RR67" offset="0x130" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="PR1RR6" caption="" mask="0xffff"/>
          <bitfield name="P1RR7" caption="" mask="0xffff0000"/>
        </register>
        <register name="DFT_VALP2RR01" offset="0x140" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="PR2RR0" caption="" mask="0xffff"/>
          <bitfield name="P2RR1" caption="" mask="0xffff0000"/>
        </register>
        <register name="DFT_VALP2RR23" offset="0x150" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="PR2RR2" caption="" mask="0xffff"/>
          <bitfield name="P2RR3" caption="" mask="0xffff0000"/>
        </register>
        <register name="DFT_VALP2RR45" offset="0x160" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="PR2RR4" caption="" mask="0xffff"/>
          <bitfield name="P2RR5" caption="" mask="0xffff0000"/>
        </register>
        <register name="DFT_VALP2RR67" offset="0x170" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="PR2RR6" caption="" mask="0xffff"/>
          <bitfield name="P2RR7" caption="" mask="0xffff0000"/>
        </register>
      </register-group>
    </module>
    <module name="PMU" id="U80" version="1.0" caption="PMU SPI controller">
      <register-group name="PMU" caption="PMU SPI controller">
        <register name="SPICTRL" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SPIWDATA" caption="" mask="0xffff"/>
          <bitfield name="SPIADDR" caption="" mask="0xff0000"/>
          <bitfield name="CMD" caption="" mask="0x1000000"/>
          <bitfield name="PMUCRST" caption="" mask="0x40000000"/>
          <bitfield name="SPIRST" caption="" mask="0x80000000"/>
        </register>
        <register name="SPISTATUS" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SPIERR" caption="" mask="0x1"/>
          <bitfield name="SPIRDY" caption="" mask="0x80"/>
          <bitfield name="SPIADDR" caption="" mask="0xff00"/>
          <bitfield name="SPIRDATA" caption="" mask="0xffff0000"/>
        </register>
        <register name="CLKCTRL" offset="0x8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SPICLKDIV" caption="" mask="0x3f"/>
          <bitfield name="PMUANA_BKBOREN" caption="" mask="0x40"/>
          <bitfield name="SPISRC" caption="" mask="0x80"/>
          <bitfield name="BUCKCLKDIV" caption="" mask="0x3f00"/>
          <bitfield name="BUCKSRC" caption="" mask="0xc000"/>
          <bitfield name="BACWD" caption="" mask="0x10000"/>
          <bitfield name="MLDOEXTEN" caption="" mask="0x20000"/>
          <bitfield name="MVREFFSMEN" caption="" mask="0x40000"/>
          <bitfield name="CMP_CYCLE" caption="" mask="0xf00000"/>
          <bitfield name="BKCLK_HW_OVR" caption="" mask="0x1000000"/>
          <bitfield name="MLDOEXT_BOREN" caption="" mask="0x4000000"/>
          <bitfield name="ADCBOREN" caption="" mask="0x8000000"/>
          <bitfield name="BUCKBOREN" caption="" mask="0x10000000"/>
          <bitfield name="F_BCLK_CFG" caption="" mask="0x20000000"/>
          <bitfield name="WLDOOFF" caption="" mask="0x40000000"/>
          <bitfield name="WCMRET" caption="" mask="0x80000000"/>
        </register>
        <register name="MODECTRL1" offset="0xc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="VREG4CTRL" caption="" mask="0x1f"/>
          <bitfield name="VREG3CTRL" caption="" mask="0x1f00"/>
          <bitfield name="VREG2CTRL" caption="" mask="0x1f0000"/>
          <bitfield name="VREG1CTRL" caption="" mask="0x1f000000"/>
          <bitfield name="BUCKMODE" caption="" mask="0x20000000"/>
          <bitfield name="MLDOEN" caption="" mask="0x40000000"/>
          <bitfield name="BUCKEN" caption="" mask="0x80000000"/>
        </register>
        <register name="MODECTRL2" offset="0x10" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="VREG4CTRL" caption="" mask="0x1f"/>
          <bitfield name="VREG3CTRL" caption="" mask="0x1f00"/>
          <bitfield name="VREG2CTRL" caption="" mask="0x1f0000"/>
          <bitfield name="VREG1CTRL" caption="" mask="0x1f000000"/>
          <bitfield name="BUCKMODE" caption="" mask="0x20000000"/>
          <bitfield name="MLDOEN" caption="" mask="0x40000000"/>
          <bitfield name="BUCKEN" caption="" mask="0x80000000"/>
        </register>
        <register name="MODECTRL3" offset="0x14" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="VREG4CTRL" caption="" mask="0x1f"/>
          <bitfield name="VREG3CTRL" caption="" mask="0x1f00"/>
          <bitfield name="VREG2CTRL" caption="" mask="0x1f0000"/>
          <bitfield name="VREG1CTRL" caption="" mask="0x1f000000"/>
          <bitfield name="BUCKMODE" caption="" mask="0x20000000"/>
          <bitfield name="MLDOEN" caption="" mask="0x40000000"/>
          <bitfield name="BUCKEN" caption="" mask="0x80000000"/>
        </register>
