Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.107/BZ25/atdf/PIC32CX1012BZ25048.atdf
        <register name="RPA0G3R" offset="0x204" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA0G3R" caption="RPA0/G3" mask="0x1f" values="RPA0G3_PINS"/>
        </register>
        <register name="RPA1G3R" offset="0x208" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA1G3R" caption="RPA1/G3" mask="0x1f" values="RPA1G3_PINS"/>
        </register>
        <register name="RPA1G4R" offset="0x20c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA1G4R" caption="RPA1/G4" mask="0x1f" values="RPA1G4_PINS"/>
        </register>
        <register name="RPA2G1R" offset="0x210" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA2G1R" caption="RPA2/G1" mask="0x1f" values="RPA2G1_PINS"/>
        </register>
        <register name="RPA2G4R" offset="0x214" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA2G4R" caption="RPA2/G4" mask="0x1f" values="RPA2G4_PINS"/>
        </register>
        <register name="RPA3G1R" offset="0x218" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA3G1R" caption="RPA3/G1" mask="0x1f" values="RPA3G1_PINS"/>
        </register>
        <register name="RPA3G2R" offset="0x21c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA3G2R" caption="RPA3/G2" mask="0x1f" values="RPA3G2_PINS"/>
        </register>
        <register name="RPA3G3R" offset="0x220" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA3G3R" caption="RPA3/G3" mask="0x1f" values="RPA3G3_PINS"/>
        </register>
        <register name="RPA4G2R" offset="0x224" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA4G2R" caption="RPA4/G2" mask="0x1f" values="RPA4G2_PINS"/>
        </register>
        <register name="RPA4G3R" offset="0x228" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA4G3R" caption="RPA4/G3" mask="0x1f" values="RPA4G3_PINS"/>
        </register>
        <register name="RPA4G4R" offset="0x22c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA4G4R" caption="RPA4/G4" mask="0x1f" values="RPA4G4_PINS"/>
        </register>
        <register name="RPA5G1R" offset="0x230" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA5G1R" caption="RPA5/G1" mask="0x1f" values="RPA5G1_PINS"/>
        </register>
        <register name="RPA5G3R" offset="0x234" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA5G3R" caption="RPA5/G3" mask="0x1f" values="RPA5G3_PINS"/>
        </register>
        <register name="RPA5G4R" offset="0x238" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA5G4R" caption="RPA5/G4" mask="0x1f" values="RPA5G4_PINS"/>
        </register>
        <register name="RPA6G1R" offset="0x23c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA6G1R" caption="RPA6/G1" mask="0x1f" values="RPA6G1_PINS"/>
        </register>
        <register name="RPA6G2R" offset="0x240" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA6G2R" caption="RPA6/G2" mask="0x1f" values="RPA6G2_PINS"/>
        </register>
        <register name="RPA6G4R" offset="0x244" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA6G4R" caption="RPA6/G4" mask="0x1f" values="RPA6G4_PINS"/>
        </register>
        <register name="RPA7G1R" offset="0x248" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA7G1R" caption="RPA7/G1" mask="0x1f" values="RPA7G1_PINS"/>
        </register>
        <register name="RPA7G2R" offset="0x24c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA7G2R" caption="RPA7/G2" mask="0x1f" values="RPA7G2_PINS"/>
        </register>
        <register name="RPA8G2R" offset="0x250" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA8G2R" caption="RPA8/G2" mask="0x1f" values="RPA8G2_PINS"/>
        </register>
        <register name="RPA8G3R" offset="0x254" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA8G3R" caption="RPA8/G3" mask="0x1f" values="RPA8G3_PINS"/>
        </register>
        <register name="RPA8G4R" offset="0x258" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA8G4R" caption="RPA8/G4" mask="0x1f" values="RPA8G4_PINS"/>
        </register>
        <register name="RPA9G1R" offset="0x25c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA9G1R" caption="RPA9/G1" mask="0x1f" values="RPA9G1_PINS"/>
        </register>
        <register name="RPA9G3R" offset="0x260" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA9G3R" caption="RPA9/G3" mask="0x1f" values="RPA9G3_PINS"/>
        </register>
        <register name="RPA9G4R" offset="0x264" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA9G4R" caption="RPA9/G4" mask="0x1f" values="RPA9G4_PINS"/>
        </register>
        <register name="RPA10G1R" offset="0x268" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA10G1R" caption="RPA10/G1" mask="0x1f" values="RPA10G1_PINS"/>
        </register>
        <register name="RPA10G4R" offset="0x26c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA10G4R" caption="RPA10/G4" mask="0x1f" values="RPA10G4_PINS"/>
        </register>
        <register name="RPA13G3R" offset="0x278" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA13G3R" caption="RPA13/G3" mask="0x1f" values="RPA13G3_PINS"/>
        </register>
        <register name="RPA13G4R" offset="0x27c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA13G4R" caption="RPA13/G4" mask="0x1f" values="RPA13G4_PINS"/>
        </register>
