Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.107/BZ25/atdf/PIC32CX1012BZ25048.atdf
        <register name="RPA14G1R" offset="0x280" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA14G1R" caption="RPA14/G1" mask="0x1f" values="RPA14G1_PINS"/>
        </register>
        <register name="RPA14G4R" offset="0x284" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA14G4R" caption="RPA14/G4" mask="0x1f" values="RPA14G4_PINS"/>
        </register>
        <register name="RPB0G1R" offset="0x28c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB0G1R" caption="RPB0/G1" mask="0x1f" values="RPB0G1_PINS"/>
        </register>
        <register name="RPB0G2R" offset="0x290" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB0G2R" caption="RPB0/G2" mask="0x1f" values="RPB0G2_PINS"/>
        </register>
        <register name="RPB1G2R" offset="0x294" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB1G2R" caption="RPB1/G2" mask="0x1f" values="RPB1G2_PINS"/>
        </register>
        <register name="RPB1G3R" offset="0x298" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB1G3R" caption="RPB1/G3" mask="0x1f" values="RPB1G3_PINS"/>
        </register>
        <register name="RPB2G3R" offset="0x29c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB2G3R" caption="RPB2/G3" mask="0x1f" values="RPB2G3_PINS"/>
        </register>
        <register name="RPB2G4R" offset="0x2a0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB2G4R" caption="RPB2/G4" mask="0x1f" values="RPB2G4_PINS"/>
        </register>
        <register name="RPB3G1R" offset="0x2a4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB3G1R" caption="RPB3/G1" mask="0x1f" values="RPB3G1_PINS"/>
        </register>
        <register name="RPB3G4R" offset="0x2a8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB3G4R" caption="RPB3/G4" mask="0x1f" values="RPB3G4_PINS"/>
        </register>
        <register name="RPB4G1R" offset="0x2ac" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB4G1R" caption="RPB4/G1" mask="0x1f" values="RPB4G1_PINS"/>
        </register>
        <register name="RPB4G2R" offset="0x2b0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB4G2R" caption="RPB4G2" mask="0x1f" values="RPB4G2_PINS"/>
        </register>
        <register name="RPB5G2R" offset="0x2b4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB5G2R" caption="RPB5/G2" mask="0x1f" values="RPB5G2_PINS"/>
        </register>
        <register name="RPB5G3R" offset="0x2b8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB5G3R" caption="RPB5/G3" mask="0x1f" values="RPB5G3_PINS"/>
        </register>
        <register name="RPB6G3R" offset="0x2bc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB6G3R" caption="RPB6/G3" mask="0x1f" values="RPB6G3_PINS"/>
        </register>
        <register name="RPB6G4R" offset="0x2c0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB6G4R" caption="RPB6/G4" mask="0x1f" values="RPB6G4_PINS"/>
        </register>
        <register name="RPB7G1R" offset="0x2c4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB7G1R" caption="RPB7/G1" mask="0x1f" values="RPB7G1_PINS"/>
        </register>
        <register name="RPB7G4R" offset="0x2c8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB7G4R" caption="RPB7/G4" mask="0x1f" values="RPB7G4_PINS"/>
        </register>
        <register name="RPB8G1R" offset="0x2cc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB8G1R" caption="RPB8/G1" mask="0x1f" values="RPB8G1_PINS"/>
        </register>
        <register name="RPB8G2R" offset="0x2d0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB8G2R" caption="RPB8/G2" mask="0x1f" values="RPB8G2_PINS"/>
        </register>
        <register name="RPB9G2R" offset="0x2d4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB9G2R" caption="RPB9/G2" mask="0x1f" values="RPB9G2_PINS"/>
        </register>
        <register name="RPB9G3R" offset="0x2d8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB9G3R" caption="RPB9/G3" mask="0x1f" values="RPB9G3_PINS"/>
        </register>
        <register name="RPB10G3R" offset="0x2dc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB10G3R" caption="RPB10/G3" mask="0x1f" values="RPB10G3_PINS"/>
        </register>
        <register name="RPB10G4R" offset="0x2e0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB10G4R" caption="RPB10/G4" mask="0x1f" values="RPB10G4_PINS"/>
        </register>
        <register name="RPB11G1R" offset="0x2e4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB11G1R" caption="RPB11/G1" mask="0x1f" values="RPB11G1_PINS"/>
        </register>
        <register name="RPB11G4R" offset="0x2e8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB11G4R" caption="RPB11/G4" mask="0x1f" values="RPB11G4_PINS"/>
        </register>
        <register name="RPB12G1R" offset="0x2ec" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPB12G1R" caption="RPB12/G1" mask="0x1f" values="RPB12G1_PINS"/>
        </register>
